use option_2;

--вставка отвратно
insert into horse_owner (name_owner, adress, phone)
values
('Иван','город Уфа', '89178989899'),
('Лёша','город Тюмень', '89659238002'),
('Юра','город Москва', '89659238002'),
('Катя','город Москва', '89659238002'),
('Диана','город Сочи', '89659238002'),
('Саша','город Екатеринбург', '89659238002'),
('Эрик','город Казань', '89659238002'),
('Вова','город Уфа', '89659238002'),
('Вячеслав','город Красноярск', '89659238002'),
('Антонина','город Уфа', '89659238002')

insert into horse (id_owner, name_horse, sex, age)
values
(1,'Звёздочка','муж',11),
(2,'Мигель','жен',4),
(3,'Дружба','муж',5),
(5,'Любава','жен',5),
(7,'Мира','жен',15),
(6,'Рысь','жен',10),
(4,'Малыш','муж',2),
(8,'Звёздочка','муж',11),
(10,'Попугай','муж',7),
(9,'Сердечко','жен',11)

insert into jockey (name_jockey, adress, age, rating)
values
('Фёдор','город Тюмень',21,5.7),
('Мирослав','город Сочи',33,8.9),
('Антон','город Уфа',19,7.7),
('Саша','город Москва',21,9.7),
('Ипполит','город Тюмень',26,5.1),
('Феодосия','город Казань',21,9.0),
('Влад','город Тюмень',28,5.7),
('Даша','город Сочи',21,5.7),
('Мирослава','город Красноярск',29,9.1),
('Ульяна','город Уфа',21,5.7);

insert into competition (name_competition, date_competition, time_competition, hippodrome)
values
('Вперёд','2013-06-06','10:00:00','Уфа'),
('Назад','2011-06-16','10:00:00','Красноярск'),
('Юху','2020-12-12','10:00:00','Москва'),
('Победа','2015-08-22','10:00:00','Тюмень'),
('Откат','2017-05-26','10:00:00','Пермь');


insert into check_in(id_competition)
values
(3),
(3),
(2),
(2),
(5);

insert into pair (id_horse, id_jockey)
values
(CEILING(1+rand()*(10-1)),CEILING(1+rand()*(10-1))),
(CEILING(1+rand()*(10-1)),CEILING(1+rand()*(10-1))),
(CEILING(1+rand()*(10-1)),CEILING(1+rand()*(10-1))),
(CEILING(1+rand()*(10-1)),CEILING(1+rand()*(10-1))),
(CEILING(1+rand()*(10-1)),CEILING(1+rand()*(10-1)));

insert into participants (id_pair, id_check_in, time_participants, place_participants)
values
(1,3,30.8,4),
(3,3,22.5,1),
(2,2,43.5,3),
(4,4,40.5,1),
(5,4,28.8,5);

select *from horse_owner;
select *from horse;
select *from jockey;
select *from competition;
select *from check_in;
select *from participants;
select *from pair;